In [8]:
import pandas as pd
notas = {'Alunos':['Bruno', 'João', 'Ana', 'José'], 
        'Notas':['10', '7', '10', '4'],
        'Situação':['Aprovado', 'Aprovado', 'Aprovado', 'Reprovado']}

In [10]:
tabela = pd.DataFrame(notas)
print(tabela)

  Alunos Notas   Situação
0  Bruno    10   Aprovado
1   João     7   Aprovado
2    Ana    10   Aprovado
3   José     4  Reprovado

In [12]:
tabela.head()

  Alunos Notas   Situação
0  Bruno    10   Aprovado
1   João     7   Aprovado
2    Ana    10   Aprovado
3   José     4  Reprovado

In [15]:
tabela.shape

(4, 3)

In [18]:
tabela.describe()

       Alunos Notas  Situação
count       4     4         4
unique      4     3         2
top     Bruno    10  Aprovado
freq        1     2         3

In [19]:
tabela['Situação'] #Encontrar a coluna

0     Aprovado
1     Aprovado
2     Aprovado
3    Reprovado
Name: Situação, dtype: object

In [23]:
tabela.loc[[0, 2, 3]] #Encontrar a LINHa

  Alunos Notas   Situação
0  Bruno    10   Aprovado
2    Ana    10   Aprovado
3   José     4  Reprovado

In [30]:
tabela.loc[tabela['Notas'] == '10'] #Informação específica sobre a linha

  Alunos Notas  Situação
0  Bruno    10  Aprovado
2    Ana    10  Aprovado